# In this project we are extracting data from the CIA Factbook using SQL to provide answers to various questions.

In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [2]:
%%sql
SELECT *
    FROM sqlite_master
    WHERE type = 'table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

# Display the first five rows of facts

In [3]:
%%sql

SELECT *
    FROM facts
    LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

# Query to return the following:
    Minimum population
    Maximum population
    Minimum population growth
    Maximum population growth

In [4]:
%%sql

SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
    FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

# Query to return the country with the minimum population

In [5]:
%%sql

SELECT *
    FROM facts
    WHERE population == (SELECT MIN(population)
                             FROM facts);

Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

# Query to return the country with the maximum population

In [6]:
%%sql
SELECT *
    FROM facts
    WHERE population == (SELECT MAX(population)
                             FROM facts);

Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

# We can see that this data includes World as a country which includes 7.2 Billion people so we exclude the world row.

In [7]:
%%sql

SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
    FROM facts
    WHERE name != 'World';

Done.

[(0, 1367485388, 0.0, 4.02)]

# Calculate the average value for population and area columns

In [8]:

%%sql
SELECT AVG(population), AVG(area)
    FROM facts
    WHERE name != 'World';

Done.

[(32242666.56846473, 555093.546184739)]

# Subquery to find all countries where the population is above average AND the area is below average

In [9]:
%%sql

SELECT name
    FROM facts
    WHERE (population > (SELECT AVG(population) as AVG_population
    FROM facts
    WHERE name != 'World'))
    AND (area < (SELECT AVG(area) as AVG_area
    FROM facts
    WHERE name != 'World'))

Done.

[('Bangladesh',),
 ('Germany',),
 ('Iraq',),
 ('Italy',),
 ('Japan',),
 ('Korea, South',),
 ('Morocco',),
 ('Philippines',),
 ('Poland',),
 ('Spain',),
 ('Thailand',),
 ('Uganda',),
 ('United Kingdom',),
 ('Vietnam',)]

# Which country has the most people?

In [12]:
%%sql

SELECT name, population
    FROM facts
    WHERE name != 'World'
    ORDER BY population DESC
    LIMIT 1;

Done.

[('China', 1367485388)]

# China is the country with the most people in the world

# Which country has the highest growth rate?

In [13]:
%%sql

SELECT name, population_growth
    FROM facts
    WHERE name != 'World'
    ORDER BY population_growth DESC
    LIMIT 1;

Done.

[('South Sudan', 4.02)]

# South Sudan is the country with the highest growth rate

# Which countries have the highest ratios of water to land?

In [19]:
%%sql
SELECT name, area,area_water,area_land, area_water/area_land AS RatioWaterToLand
    FROM facts
    WHERE name != 'World'
    ORDER BY RatioWaterToLand DESC
    LIMIT 2;

Done.

[('British Indian Ocean Territory', 54400, 54340, 60, 905),
 ('Virgin Islands', 1910, 1564, 346, 4)]

# From the table below the British Indian Ocean Territory and Virgin Islands have the highest water to land ratio

# Which countries have more water than land?

In [20]:
%%sql

SELECT name, area_water, area_land
    FROM facts
    WHERE area_water > area_land;

Done.

[('British Indian Ocean Territory', 54340, 60), ('Virgin Islands', 1564, 346)]

# The British Indian Ocean Territory and Virgin Islands have more water than land